package ru.geekbrains.micecreator.controllers;

public class TourController {
	/*
	 * /tours
	 * работа со списочной формой тура
	 * При открытии страницы возвращается список всех туров
	 * Найти тур по номеру
	 * Найти тур по дате
	 * Найти тур по дате и стране
	 * Создать новый тур -> на полную форму
	 * Редактировать -> на полную форму
	 * tours/number
	 * Работа с полной формой тура
	 * Просмотр составных частей в списочной форме
	 * Пересчитать общую стоимость после редактирования внутренних сущностей
	 * редактировать ->на полную форму той или иной сущности
	 * добавить новую часть -> на полную форму той или иной сущности
	 * удалить часть -> на полную форму той или иной сущности*/
}
